Idearator/app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    if not user_signed_in? or current_user.type != 'Admin'
      render :text => "You Need To sign in as An Admin"
      return
    end
      @tags = Tag.all

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    if not user_signed_in? or current_user.type != 'Admin'
      render :text => "You Need To sign in as An Admin"
      return
    end
    @tag = Tag.find(params[:id])

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    if not user_signed_in? or current_user.type != 'Admin'
      render :text => "You Need To sign in as An Admin"
      return
    end
    @tag = Tag.find(params[:id])

INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 25 Mar 2013 17:32:51 UTC +00:00], ["name", nil], ["updated_at", Mon, 25 Mar 2013 17:32:51 UTC +00:00]]
---
  def create
    if not user_signed_in? or current_user.type != 'Admin'
      render :text => "You Need To sign in as An Admin"
      return
    end
    @tag = Tag.new(params[:tag])
    respond_to do |format|
      if @tag.save

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "tags" SET "name" = 'Re', "updated_at" = '2013-03-26 10:50:18.151448' WHERE "tags"."id" = 2
---
  def update
    if not user_signed_in? or current_user.type != 'Admin'
      render :text => "You Need To sign in as An Admin"
      return
    end
    @tag = Tag.find(params[:id])
    respond_to do |format|
      if @tag.update_attributes(params[:tag])

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
---
  def destroy
    if not user_signed_in? or current_user.type != 'Admin'
      render :text => "You Need To sign in as An Admin"
      return
    end
    @tag = Tag.find(params[:id])
    @tag.destroy

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "4"]]
SELECT 1 AS one FROM "tags" WHERE ("tags"."name" = 'Software' AND "tags"."id" != 3) LIMIT 1
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 26 Mar 2013 22:40:52 UTC +00:00], ["name", "Softwaref"], ["updated_at", Tue, 26 Mar 2013 22:40:52 UTC +00:00]]
---
  def addsym
    if not user_signed_in? or current_user.type != 'Admin'
      render :text => "You Need To sign in as An Admin"
      return
    end
    @tag = Tag.find(params[:id])
    y = params[:tag]['name']
    tag_query = Tag.where("name = ?", y)
    respond_to do |format|
      if tag_query.empty?
        t = Tag.new(:name => y)
        t.save