app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @tag = Tag.find(params[:id])

INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 25 Mar 2013 17:32:51 UTC +00:00], ["name", nil], ["updated_at", Mon, 25 Mar 2013 17:32:51 UTC +00:00]]
---
  def create
    @tag = Tag.new(params[:tag])

    respond_to do |format|
      if @tag.save

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "tags" SET "name" = 'Re', "updated_at" = '2013-03-26 10:50:18.151448' WHERE "tags"."id" = 2
---
  def update
    @tag = Tag.find(params[:id])

    respond_to do |format|
      if @tag.update_attributes(params[:tag])

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "4"]]
SELECT 1 AS one FROM "tags" WHERE ("tags"."name" = 'Software' AND "tags"."id" != 3) LIMIT 1
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 26 Mar 2013 22:40:52 UTC +00:00], ["name", "Softwaref"], ["updated_at", Tue, 26 Mar 2013 22:40:52 UTC +00:00]]
---
  def addsym
    @tag = Tag.find(params[:id])
    y = params[:tag]['name']
    #query for finding tag with input name returns Tag Array
    tag_query = Tag.where("name = ?", y)
    respond_to do |format|
      if tag_query.empty?
        t = Tag.new(:name => y)
        t.save